Revit 2024 API
FilterDialog.NewFilterId Property
 The ElementId of the new filter created. The value is populated after Show method is executed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId NewFilterId { get; }
Visual Basic
Public ReadOnly Property NewFilterId As ElementId
	Get
Visual C++
public:
property ElementId^ NewFilterId {
	ElementId^ get ();
}
See Also
FilterDialog Class
Autodesk.Revit.UI Namespace